# vsoWidgetPopupAdd

## Description
```pascal
PROCEDURE vsoWidgetPopupAdd(
				widgetID : LONGINT;
				id       : STRING;
				text     : STRING);
```

```python

def vs.vsoWidgetPopupAdd(widgetID, id, text):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|widgetID|LONGINT||
|id|STRING||
|text|STRING||

## Version
Availability: from Vectorworks 2011
## Category
* Object Events